Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/M04.tmx
Source language: en_us
Languages: zh_cn

source: The Love Game
zh_cn: 爱的游戏

source: When marimba rhythms start to play
zh_cn: 当木琴的旋律开始奏起，

source: Dance with me, make me sway
zh_cn: 请与我共舞，让我摇摆

source: Like a lazy ocean hugs the shore
zh_cn: 像慵懒的海水拥抱着海滩，

source: Hold me close, sway me more
zh_cn: 将我抱紧，让我摇摆

source: Like a flower bending in the breeze
zh_cn: 像一朵鲜花在微风中弯曲，

source: Bend with me, sway with ease
zh_cn: 随我弯腰，轻松摇摆

source: When we dance you have a way with me
zh_cn: 当我们共舞你将我驯服，

source: Stay with me, sway with me
zh_cn: 请别离开，随我摇摆

source: Other dancers may be on the floor
zh_cn: 舞池中仍有其他舞者，

source: Dear, but my eyes will see only you
zh_cn: 可亲爱的我的眼中只有你

source: Only you have the magic technique
zh_cn: 只有你有那魔幻的技巧，

source: When we sway I go weak
zh_cn: 在摇摆中让我痴迷

source: I can hear the sounds of violins
zh_cn: 小提琴的声音还未响起，

source: Long before it begins
zh_cn: 我却早已听到它的韵律

source: Make me thrill as only you know how
zh_cn: 那刺激的感觉只有你才知道，

source: Sway me smooth, sway me now
zh_cn: 圆润流畅，与我摇摆

source: Light breeze drifted through a little patch of trees.
zh_cn: 轻柔的微风从一片常绿树林中轻轻穿过。

source: Morning sunshine splattered through the evergreen leaves and branches, falling onto a cluster of viburnum that was growing under the tree.
zh_cn: 早晨的阳光在绿色的枝叶间洒下，落在树下一簇低矮的清丽花丛中。

source: A little bell shaped flower dangled in the winds, nodding from the tip of a hollow scape that stands just about the threadlike leaves.
zh_cn: 长长的粉绿色的叶丛中，悬挂着一个铃铛似的花朵，娇小玲珑，在风中轻轻点头。

source: It had six snow-white petals, each with a small emerald green spot near its tip.
zh_cn: 它有着六个雪白的花瓣，花瓣顶端镶嵌着造型美丽的翡翠绿斑，显得格外亲切可爱。

source: A young man walked into the forest, enjoying the early morning freshness of the air.
zh_cn: 一位年轻人走进丛林，享受着这清冽的初春气息。

source: His eyes lighted up when he spotted the little flower.
zh_cn: 忽然，他眼睛一亮，随意的目光落到那小小的白花之上。

source: "Awww, a little snowflake.
zh_cn: “噢，一朵小雪花莲。

source: Haven't you opened a little early this year?
zh_cn: 你开的是不是有点早了呢？

source: See your friends are still not here yet."
zh_cn: 你看，你的伙伴们都还没有来呢。”

source: He sat down beside the snowflake, took out a flute and started to play.
zh_cn: 他在雪花莲旁边的石头上坐下，拿出一支笛子，开始吹了起来。

source: Every morning, he came to play his flute beside the little snowflake.
zh_cn: 每天早晨，他都会这样来到小雪花莲的旁边吹他的长笛。

source: Every morning, the little snowflake danced with the soft and fluent music that flew around the forest.
zh_cn: 每天早晨，小雪花莲亦会随着那环绕林中的轻幽柔美的音乐在风中轻舞。

source: One day, while he was playing the flute, he heard a light laugh.
zh_cn: 有一天，吹笛子的时候，他忽然听到了一声轻笑。

source: He turned around, and saw her, white dress, black hair, with an emerald green ribbon on her hair.
zh_cn: 转过身，他便看到了她，白衣飘飘，乌黑的长发上束着一个翠绿的发带。

source: "Who are you?" "I live in this forest.
zh_cn: “你是谁？”她微笑着：“我就住在这片森林里。

source: I like your flute so much.
zh_cn: 我很喜欢你吹的笛子。

source: Can you play it for me one more time?"
zh_cn: 可以为我再吹一曲吗？”

source: He played, and she danced with the music.
zh_cn: 他点头，将长笛缓缓举到嘴边。

source: And then she ran away, laughing.
zh_cn: 而她便随着音乐跳起舞来。

source: The forest became quiet again, like nothing had happened.
zh_cn: 森林重又变得宁静，好像什么也没有发生。

source: He rubbed his eyes, and tried to search the depths of the forest, but he couldn't find any trace of her.
zh_cn: 他揉了揉眼睛，向森林的深处望去，可是却找不到她的任何踪影。

source: The next morning, he came and played his flute. And she came again, laughing and dancing.
zh_cn: 第二天早上，他来到树林里吹笛子的时候，她又来了，笑着，舞着。

source: The snowflake flowers had now bloomed, like little white stars in a green sky, stopping every pair of eyes of people who happened to pass by.
zh_cn: 春已经深了，雪花莲盛开着，像一颗颗白色的星星在绿色的天幕上闪烁，让每一个正巧路过的人不经意地驻足。

source: Many fresh mornings passed, she danced to his music and laughed with him.
zh_cn: 一个一个清新的早晨就这样悄悄过去了，他为她吹笛，她为他起舞。

source: But every time when he tried to catch her hands, she fled and disappeared into the forest.
zh_cn: 但每次当他试图抓住她的手的时候，她就会咯咯笑着，逃到森林深处，消失不见。

source: One day, he didn't come.
zh_cn: 有一天，他没有来。

source: Then the next day, he didn't come.
zh_cn: 第二天，他依然没来。

source: The early summer was hot and dry.
zh_cn: 那是一个炎热而干燥的初夏。

source: There hadn't been a rainfall for many many days.
zh_cn: 很久都没有下雨了。

source: White snowflake petals shed to the ground, and became brown.
zh_cn: 白色的雪花莲花瓣飘落到地面，变成了暗淡的褐色。

source: "What happened?
zh_cn: “出什么事了？

source: What can I do?"
zh_cn: 我该怎么办呢？”

source: She asked.
zh_cn: 她问出声来。

source: "I want to become a human like him."
zh_cn: “或许，我能变成像他一样。”

source: "Human life is very short, snowflake.
zh_cn: “人的生命是很短促的，小雪花莲。

source: The flower spirits don't die."
zh_cn: 而花仙却永远不会死。”

source: A voice answered.
zh_cn: 她忽然听到一个声音的回答。

source: "I don't care.
zh_cn: “我不在乎。

source: I want to be like him.
zh_cn: 我只想变成像他一样。

source: I want to be with him."
zh_cn: 我要和他在一起。”

source: "Sigh.
zh_cn: “唉。”那声音叹息了。

source: If he loves you, when he kisses you, you'll be turned into a real woman.
zh_cn: 如果他真的爱你，当他吻你的时侯，你就会变成一个真正的女人。

source: But you'll never be able to turn back to your original shape, and you'll never be able to come back to us, you understand?"
zh_cn: 可是，你却永远都不能再回头了。你永远都不会回到原来的形状，也永远不能回来和你的姐妹们在一起，你明白吗？”

source: "Yes!
zh_cn: “好的！

source: I understand."
zh_cn: 我明白了。”

source: A big smile blossomed at the corners of her dry lips.
zh_cn: 一朵笑容在她干裂的唇角绽开。

source: He finally came.
zh_cn: 那天，他终于来了。

source: A little water can was in his hand.
zh_cn: 手里提着一个小小的水壶。

source: "This summer must be hard for you, little snowflake."
zh_cn: “今年夏天苦了你了，小雪花莲。”

source: He murmured when he poured water to the root of the plant.
zh_cn: 他喃喃地说着，将水一瓢一瓢地浇在花根。

source: Snowflake's heart was so full, and so sweet.
zh_cn: 小雪花莲的心满溢着甜美。

source: "Play your flute for me, please."
zh_cn: “再为我吹一曲笛子吧。”

source: She whispered into the wind.
zh_cn: 她轻轻低语。

source: "Wow, such beautiful flowers!"
zh_cn: “哇，好漂亮的花！”

source: A soft girl's voice sounded behind the young man.
zh_cn: 一个女孩的柔软声音从年轻人的身后响起。

source: He turned to her and smiled.
zh_cn: 他转过身，淡淡地朝着她笑了。

source: "Yes, they are pretty, aren't they?
zh_cn: “是啊，它们都很漂亮，是不是？

source: I used to come here and play my flute everyday.
zh_cn: 我过去每天都会来这里吹笛子。

source: There is a girl live in this forest too.
zh_cn: 有一个女孩子就在这片林子里住。

source: I used to think she is a fairy."
zh_cn: 我曾经以为她是个仙女呢。”

source: He said dreamingly.
zh_cn: 他的声音飘忽着，如梦如幻。

source: "Come on, let's go.
zh_cn: “咱们快走吧。

source: We are almost late for the flight."
zh_cn: 再晚就赶不上飞机了。”

source: "Wait a second.
zh_cn: “等一下。

source: I want to play my flute one last time.
zh_cn: 我想最后再吹一次笛子。

source: And I'll introduce you to her if she comes. I want to say goodbye to her."
zh_cn: 希望能跟她说一声再见。如果她来了的话，我会介绍你认识她。”

source: He raised the flute to his mouth.
zh_cn: 缓缓地，他把笛子放到嘴边。

source: Soft music flew around the trees.
zh_cn: 轻柔的音乐又一次飞翔在寂静的林间。

source: But she didn't come.
zh_cn: 可是，她却再没有出现。

source: He finished his music, sighed.
zh_cn: 一曲终了，他轻轻地叹息。

source: He knelt down beside the snowflake, gently touched the snow-white petal.
zh_cn: 他在身旁的雪花莲边上跪下，用指尖轻触着那雪白色的花瓣。

source: "Good bye little snowflake."
zh_cn: “再见了，小雪花莲。”

source: A drop of water rolled out off the snowflake petal, into his hand.
zh_cn: 一滴圆圆的水珠从花瓣上滚下，滑落到他的手中。

source: He suddenly felt dizzy.
zh_cn: 他突然感到一阵晕眩。

source: He saw the girl again, white dress, black hair, with a green ribbon on her hair.
zh_cn: 恍惚中，他又看到了那女孩，白衣飘飘，乌黑的长发上束着一条翠绿的发带。

source: She slowly rose up from the snowflake flower, wrapped her arms around him, and pressed her lips on his.
zh_cn: 她从雪花莲边缓缓升起，两只手环绕着他的脖子，红唇轻轻印向他的嘴唇。

source: He felt like a static shock on his lips, and through his body.
zh_cn: 他只觉得如遇电击，在周身传遍。

source: And he suddenly woke up. He stood up and looked around.
zh_cn: 片刻之后，他清醒过来，站起身环顾四周。

source: The forest was quiet as before except for the light breeze blew through the trees.
zh_cn: 安静的小树林像从前一样，哪有芳踪渺渺，只余微风淡淡。

source: He opened his hand.
zh_cn: 他张开手，低头看去。

source: A snowflake petal lay inside.
zh_cn: 一片白色的雪花莲花瓣静静地躺在他的手心。

source: It was as white as snow, with a small emerald green spot near its tip. Like a teardrop.
zh_cn: 花瓣如雪。在那花瓣的顶端有一个小小的绿斑，好像一滴翠绿的珠泪。

source: A gust of wind swirled around with scattered snow-white flower petals.
zh_cn: 一阵大风吹过，散落一地的雪花莲花瓣被风吹起，在空中飞舞盘旋。

source: A dimly lighted phrase showed up in the middle of the snowflake background: "Sorry, you lost."
zh_cn: 一行闪着暗暗荧光的字样在雪白花瓣的背景下现出：“对不起，你输了。”

source: Flinging open the cover, the girl stood up from her seat drearily and walked toward the game master desk.
zh_cn: 女孩掀开身后游戏舱的盖子，站起身来，满怀忧郁地朝管理员走去。

source: She handed her game piece card to the GM and said simply, "I'd like to play another game please."
zh_cn: 她递上自己的游戏卡，简单地说：“我想再玩一次。”

source: The GM inserted her GP card into the GP reader, and then handed it back to her.
zh_cn: 管理员无语接过，将卡插进读卡机，然后递还给她。

source: Another one hooked up hopelessly, he sighed to himself.
zh_cn: “又是一个无可救药地迷上这游戏的人。”他在心中轻叹。

source: Fly me to the moon
zh_cn: 让我飞向月亮，

source: Let me sing among those stars
zh_cn: 让我在群星之间歌唱。

source: Let me see what spring is like On Jupiter and Mars
zh_cn: 让我看看在木星和火星上春天是什么模样。

source: In other words, hold my hand
zh_cn: 也就是说，请握紧我的双手；

source: In other words, baby kiss me
zh_cn: 也就是说，请轻轻吻我

source: Fill my heart with song
zh_cn: 让歌声填满我的心灵，

source: Let me sing for ever more
zh_cn: 让我永不停歇的歌唱。

source: You are all I long for
zh_cn: 你是我所有的渴望，

source: All I worship and adore
zh_cn: 我的崇拜，我的挚爱。

source: In other words, please be true
zh_cn: 也就是说，请别改变；

source: In other words, I love you
zh_cn: 也就是说，我爱你

source: It had been seven days now since she ran out of the Hive after him.
zh_cn: 自她从深埋地底的营地里追出来的那天起，这已经是第七天了。

source: She still remembered their brief conversation before he left.
zh_cn: 回想起来，他离开之前他们那段短短的交谈依然历历在目。

source: "You finally did the most honorable thing."
zh_cn: “你终于做了决定了。”

source: She said quietly.
zh_cn: 她静静地说。

source: "You understand what I did and why, then?" He looked at her.
zh_cn: 你能明白我的选择吗？”他看着她的眼睛。

source: "Yes I do understand.
zh_cn: “是，我明白。

source: You have tried to do all you can for what you believe to be the right thing to do."
zh_cn: 你只是在做你认为对的事情。”

source: She tried to remain as composed as she could.
zh_cn: 她尽力维持着声音的平静。

source: "You want me to go with you?"
zh_cn: “你要我和你一起走吗？”

source: "It's up to you.
zh_cn: “这只能是你自己的决定。

source: I couldn't possibly love you any more, but I'd catch you when you jumped, and hold your hand afterwards."
zh_cn: 我也许不能再爱你了，但如果有一天你从悬崖上跳下，我会用双臂接住你，再与你携手同行。”

source: He paused, and then added, "There's not much else I can offer."
zh_cn: 他停了一下，然后补充说，”我再没有什么别的可以给你了。”

source: Her heart still pained at the coldness in his words.
zh_cn: 她至今仍然在为他话语的冰冷无情而心痛。

source: But she hated herself more.
zh_cn: 但她更恨自己。

source: For she had hesitated, wondering among duty, honor, and the most important thing in her life.
zh_cn: 恨自己的犹豫。恨自己曾在责任、荣誉，和她生命中最重要的事情之间徘徊。

source: There was no trace of him when she finally left a note and went after him from the underground.
zh_cn: 当她终于留下一张字条，带着她从小养大的阿尔法星脑虫莉莉追出营地，地面上早已没有他的踪影。

source: She had tried hard to remember what he had said before and tried to imagine which direction he would be heading.
zh_cn: 她拼命回忆着他过去的言谈，希望能猜出他远行的方向。

source: She was thrilled when she found his abandoned rover parked beside a huge fungus field at a cliff side.
zh_cn: 当她在一个悬崖边发现那辆被他遗弃的星球车的时候，她是何等的狂喜。

source: But all trails had gone cold from there.
zh_cn: 但从那时起，所有的线索都断了。

source: She had found her black butterfly in his rover.
zh_cn: 在他的车里，她看见了她的黑蝴蝶通讯仪。

source: She knew he never intended to use it when she gave it to him.
zh_cn: 其实，在她把黑蝴蝶送给他的时候，她就知道他从来没打算过用它。

source: But it still made her heart sink seeing it left behind.
zh_cn: 可是，看到他竟真的弃之如履，她的心仍不免为之一沉，看起来，他真的是和所有的一切决断了。

source: He did not leave anything for her, not a clue, or a note.
zh_cn: 在他的车里，他没给她留下只言片语。

source: She knew him too well to expect otherwise.
zh_cn: 以她对他的了解，她也知道不能有什么奢望。

source: Still she spent the entire night inside his rover, wishing to find the last warmth of his presence.
zh_cn: 不过，她还是在他的车里度过了一整个晚上，寻觅着他最后依稀的温暖。

source: She had left her own rover there and started walking on foot.
zh_cn: 从那天开始，她就离开了自己的星球车，开始徒步行走。

source: That was five days ago, or so she believed.
zh_cn: 这应该是五天前的事了，她想。

source: She was not really sure about days and times any more.
zh_cn: 其实她已经记不太清楚时间和日期了。

source: Her foods were all gone, and she was no longer bothered by the sourness of her legs and feet.
zh_cn: 她只知道，她带出来的食物已经没有了，而她酸痛的双腿也早已麻木。她只是一直向前走着，走着。

source: The worst part was the quietness, the fear.
zh_cn: 最受不了的还是那份可怕的寂静。

source: Having lived long in the underground tunnels of the Hive, she was not used to staying above ground for so long.
zh_cn: 自从来到阿尔法星，她绝大部分的时间都是住在宽敞温暖的地下隧道里，很少上到地面上来。

source: The world around her seemed so big and strange, and she felt so small and lonely.
zh_cn: 四面环顾，周围的世界是那么的空旷而怪异，而她自己却是如此的渺小而孤单。

source: Lily had kept her company, and kept her safe from the mindworms.
zh_cn: 好在她还有莉莉，那阿尔法星脑虫庞大圆润的身体像一个扁扁的圆球，一直绕在她的身边飞行。莉莉让她觉得很安全。

source: But he didn't have a mindworm of his own, how would the nights be for him?
zh_cn: 可他却并没有一个自己的阿尔法星脑虫呵。这些天的晚上，他都是怎么过的呢？

source: She stopped in front of another patch of fungus while Lily happily dived into it.
zh_cn: 天色渐晚，她来到一片巨大的真菌林前。那火红的野生真菌丛有一人多高，密密的纠缠着。莉莉兴奋地冲入林中，尽情吸取着那林中的蕴气。

source: The unattended fungus grew wildly.
zh_cn: 这样的野生真菌林是阿尔法星脑虫最喜爱的滋生地。

source: He couldn't have been here.
zh_cn: 他应该不会到过这里吧。

source: But where could he be?
zh_cn: 可是，他又会在哪里呢？

source: She sighed to herself and started to clear up an area where she could start a fire.
zh_cn: 她叹了口气，开始清理出一小块地，准备在那里生火休息。

source: The night was getting chillier.
zh_cn: 寒夜静静。

source: She sat in front of the fire, arms wrapped around her knees.
zh_cn: 她坐在火前，双手搂着膝盖，将头埋在臂弯中。

source: It was such a strange feeling.
zh_cn: 这是怎样一种奇怪的感觉呀。

source: She had nothing to lean upon, nothing to hold on to.
zh_cn: 四周空荡荡的，没有陪伴，没有倚靠。

source: The sky was so high, as if it was going to fall.
zh_cn: 天是这么的高，好像随时会掉下来。

source: The fire was flickering, as if it was unreal.
zh_cn: 火是那样的飘忽，仿佛会在夜色中消散。

source: She closed her eyes, rocking herself back and forth slowly without conscious.... I'd catch you when you jumped, and hold your hand afterwards...
zh_cn: 她闭上了眼睛，不自觉的前后摇晃起来...如果你从悬崖上跳下，我会用双臂接住你，再与你携手同行...

source: She heard his voice again, warm and comforting beside her ears.
zh_cn: 耳边又响起了他的声音，给她一份依靠和温暖。

source: She kept her eyes closed, wishing sleep would soon fall upon her....
zh_cn: 她闭着双眼，慢慢地等待着睡神的降临。

source: A finger, gently lifted a curl of hair from her temple.
zh_cn: 在那似睡似醒之间，忽然，一只手指轻触她的额头，将一缕发丝温柔地撩起。

source: She trembled inside, but she kept her eyes closed tight. She could smell him, and feel the warmness of his body. It was him...
zh_cn: 她的心颤抖起来。是他呵，他终于来了。她可以闻到他独特的男性气息。感觉到他体温的温暖。

source: His hand continued caressing her hair. She stayed still, afraid that it would go away.
zh_cn: 她一动不动，紧闭着双眼，任凭那手指在她的额上轻轻划过，生怕一睁眼那一切就会消失不见。

source: His hands slowly traced the edge of her face, slid to her neck, and down to her shoulders.
zh_cn: 他的手从她的长发抚过，爱怜地轻摩着她冰冷的面颊。手指缓缓滑过她柔软的嘴唇，光滑的脖颈，慢慢地顺着肩头滑下。

source: A little gasp escaped her lips when they were touched by his lips.
zh_cn: 她双唇微启，一声轻轻的呻吟从嘴边滑出，却被那忽然覆上的火热嘴唇打断。

source: The world started to fade away...
zh_cn: 她的世界旋转起来。

source: Her blood felt hot... Every cell of her body hungrily breathed him in. She moaned...
zh_cn: 只剩下她身体里的血沸腾着，每一颗细胞颤动着，渴望着他的触摸。

source: He deepened his kiss. She was lost in a sea... floating... She could not breathe... His hand caressing her...
zh_cn: 他将她拥入他宽厚的胸膛，深吻着，爱抚着。

source: Long fingers wrapped around her neck, tightening...Half consciously, she tried moving her head back away from him, but she couldn't. Her mouth covered by his...
zh_cn: 他的手用力的将她拥紧，越来越紧，直至她无法呼吸。她将头向后仰去，却离不开他火热的双唇。

source: She struggled to push him away but she couldn't.
zh_cn: 她伸出手用力推他，却无法离开他的前胸。

source: He was caressing... tightening...
zh_cn: 他深吻着，抚摸着，双手越来越紧。

source: Whispers surrounded her, seducing, luring... "Hongieee..." Please...
zh_cn: 耳边是他磁性的低语，她呻吟着，挣扎着，却仍然无法呼吸...求求你...不要...

source: She couldn't breathe...
zh_cn: 无法呼吸...

source: A sharp pain shot through her head and she was suddenly free.
zh_cn: 一阵剧烈的疼痛像闪电撕裂她的脑海。她忽然从那紧紧的束缚之中挣脱。

source: She opened her eyes wide and gasped in fresh air.
zh_cn: 她睁开眼，大口的喘着气。

source: Lily rotated around her, while a large boil of mindworms slowly receded toward the crimson colored fungus.
zh_cn: 莉莉围着她的身边急速地飞着，一只巨大的阿尔法星脑虫正向那野生真菌林中姗姗退去。

source: "You saved me."
zh_cn: “是你救了我。”

source: She looked at Lily appreciatively.
zh_cn: 她感激的看着莉莉。

source: As if reading her mind, Lily stopped rotating and descended in front of her.
zh_cn: 莉莉停了下来，悠悠地悬浮在她身前。

source: Pressing on her aching temple, she knew she was too tired.
zh_cn: 她轻揉着自己的太阳穴，站起身来。她知道自己是太累了。

source: She would not have fallen under the psych assault of the worms this easily, if she were her normal self.
zh_cn: 要不然她也不会如此轻易地被脑虫的神经攻击侵入。

source: Centauri A was rising from the horizon.
zh_cn: 她望向天际，半人马座A正从地平线冉冉升起。

source: It was time to head back, she decided, pushing away all thoughts of him....
zh_cn: 是时候该回去了，她对自己说。忘了他，别再想他。

source: His hand touching her body...
zh_cn: 他的手是怎样的在她的身上爱抚着...

source: She shook her head, and looked toward the direction the mindworm went, hoping to redirect her thought to the imminent danger.
zh_cn: 她使劲摇了摇头，想把脑海中那些迷幻的记忆甩掉。她向那片野生的真菌林中望去，希望以那临近的危险来冲淡她纷乱的思绪。

source: Her blood froze at what she saw.
zh_cn: 可是，她看见的那是怎样的一幅景象呵。她整个人都惊呆了，好像被凉水当头浇下。

source: Far inside the red fungus, a colony of golden mindworms wiggled, their antennae thrusting into the air.
zh_cn: 只见那火红的真菌丛的深处，漂浮着上千个脑虫。

source: A man stood in the middle of the mindworms, fighting to keep them away from him.
zh_cn: 在那众多的脑虫中央，站着一名男子，正奋力推挡，维持着一个小小的空间而不让那些脑虫近身。

source: It's him!
zh_cn: 那是他！是他啊！

source: She pushed Lily away, and continued running toward him.
zh_cn: 她用手拨开莉莉，向林中飞奔而去。
